9/data/attachments/8c14328dc5ba0377.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9a7ccd03-c2bd-49fd-8296-74a569e46d08</nif:username>
            <nif:friendToBeAdded>Tonya_along_Friend_14095_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>